
// высота шрифта
#define FONT_HEIGHT (5)

// ширина шрифта
#define FONT_WIDTH (3)

// кол-во символов в шрифте
#define FONT_COUNT (10)

#if FONT_WIDTH <= 8
typedef uint8_t  TFontBitLine;
#else
typedef uint16_t TFontBitLine;
#endif

typedef TFontBitLine TFontChar[FONT_HEIGHT];

const TFontChar LedFont[FONT_COUNT] = {
  { // 0
    0b11100000,
    0b10100000,
    0b10100000,
    0b10100000,
    0b11100000,
  },
  { // 1
    0b00100000,
    0b00100000,
    0b00100000,
    0b00100000,
    0b00100000,
  },
  { // 2
    0b11100000,
    0b00100000,
    0b11100000,
    0b10000000,
    0b11100000,
  },
  { // 3
    0b11100000,
    0b00100000,
    0b11100000,
    0b00100000,
    0b11100000,
  },
  { // 4
    0b10100000,
    0b10100000,
    0b11100000,
    0b00100000,
    0b00100000,
  },
  { // 5
    0b11100000,
    0b10000000,
    0b11100000,
    0b00100000,
    0b11100000,
  },
  { // 6
    0b11100000,
    0b10000000,
    0b11100000,
    0b10100000,
    0b11100000,
  },
  { // 7
    0b11100000,
    0b00100000,
    0b00100000,
    0b00100000,
    0b00100000,
  },
  { // 7
    0b11100000,
    0b10100000,
    0b11100000,
    0b10100000,
    0b11100000,
  },
  { // 9
    0b11100000,
    0b10100000,
    0b11100000,
    0b00100000,
    0b11100000,
  },

};







